app/controllers/annotations_controller.rb

SELECT `annotations`.* FROM `annotations`
---
  def index
    @annotations = Annotation.all

INSERT INTO `annotations` (`body`, `created_at`, `updated_at`) VALUES ('Testando as configurações', '2018-03-19 16:09:26', '2018-03-19 16:09:26')
---
  def create
    @annotation = Annotation.new(annotation_params)

    respond_to do |format|
      if @annotation.save

SELECT  `annotations`.* FROM `annotations` WHERE `annotations`.`id` = 1 LIMIT 1
---
    def set_annotation
      @annotation = Annotation.find(params[:id])